w4d3/app/controllers/cats_controller.rb

  def create
    @cat = current_user.cats.new(cat_params)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "description", "name", "sex", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @cat = current_user.cats.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 1]]

  def update
    @cat = current_user.cats.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 1]]